<?php
$var_1=true;              //Присвоили логическое значение true
$var_2=false;             //Присвоили логическое значение false
 
$var_1=(integer) $var_1;  //Теперь $var_1==1
$var_2=(integer) $var_2;  //Теперь $var_2==0
 
$var_1=(string) $var_1;   //Теперь $var_1=="1"
$var_2=(string) $var_2;   //Теперь $var_2=="0"
 
//------------------------------------------------
 
$var_3="-1";              //Присвоили строку "-1"
$var_4=".9345E3";         //Присвоили строку ".9345E3"
 
$var_3=(bool) $var_3;     //Теперь $var_3==1
$var_4=(integer) $var_4;  //Теперь $var_4==0
 
//------------------------------------------------
 
$var_5="-.57";            //Присвоили строку "-.57"
$var_6=.9345E3;           //Присвоили вещественное число, тоже 
                          //самое, что и 934.5
 
$var_5=(array) $var_5;    //Теперь $var_5==["-.57"]
$var_6=(array) $var_6;    //Теперь $var_6==[934.5]
?>