<?php
   
//Присвоили логическое значение true
$boolean_var=true;        
 
//Если условие истинно
if($boolean_var==true){   
  echo 'Выражение истинно.'
//Иначе
}else{                    
  echo 'Выражение ложно.'
}
 
//Присвоили логическое значение false
$boolean_var_2=false;    

//10, записанное в десятичной системе счисления
$a=10;      
//Отрицательное число
$b=-10;     
 
/* Число 10 в других системах счисления */
 
//восьмеричной (перед числом ставится ноль)
$c=012;     
//шестнадцатеричной (перед числом ставится ноль, затем x)
$d=0x0A;    
//двоичной (перед числом ставится ноль, затем b)
$e=0b1010;

//Положительное вещественное число
$a=123.45;    
//Отрицательное вещественное число
$b=-123.45;   
//Тоже самое, что и -0.45, т.к. ноль разрешается опускать
$c=-.45;      
//Тоже самое, что и 123.45
$d=1.2345e2;  
//Тоже самое, что и 0.0012345
$e=1.2345E-3;  
 
?>

