<?php

	/*
15. Создайте три переменные и присвойте им строки: 'Добро ', 'побеждает ', 'зло'. 
Создайте еще одну переменную и присвойте ей объединенную строку (для конкатенации 
строковых переменных используйте обычную точку). Выведите ее на экран. 
	*/

//Присвоили первую строку
$a='Добро ';      
//Присвоили вторую строку
$b='побеждает ';  
//Присвоили третью строку
$c='зло ';        
//Присвоили объединенную строк
$d=$a.$b.$c;      у
 
//Выведет 'Добро побеждает зло'
echo $d, '<br>';  
          
?>