<?php
//Приемы работы с циклами на PHP
//выведем на экран строку '111222333444555666777888999'.

	for ($i=1; $i < 10; $i++) { 
	    for ($j=1; $j < 3; $j++) { 
	        echo $i;    
	    }
	}

	echo "<br>";

//сделаем строку, заполненную десятью иксами 'x'

	$str = ''; //начальное значение - пустые кавычки
	for ($i = 0; $i < 10; $i++) {
		$str .= 'x';
	}
	
	echo $str; //выведет 'xxxxxxxxxx'

	echo '<br>';

//выведем на экран пирамидку:

	$str = '';
	for ($i = 0; $i < 10; $i++) {
		$str .= 'x';
		echo $str.'<br>';
	}

	echo '<br>';

	for ($i = 1; $i <= 9; $i++) {
		for ($j = 1; $j <= $i; $j++) {
			echo $i;
		}
		echo '<br>';
	}

	for ($i = 1; $i <= 9; $i++) {
		$str = ''; //каждый раз зачищаем строку
	
		for ($j = 1; $j <= $i; $j++) {
			$str .= $i;
		}
		echo $str.'<br>';
	}	

?>