<?php

	/*
23. Посмотрите на условие задачи и скажите, какие значения будут присвоены 
переменным после преобразования типов? Что будет выведено на экран при помощи 
оператора echo? Не забывайте, что оператор перед выводом преобразует все значения в строки!
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
<?php 
 
$var_1=true;               
$var_2=false;              
  
$var_3=(integer) $var_1;   
$var_4=(integer) $var_2;   
  
$var_5=(string) $var_1;    
$var_6=(string) $var_2;   
  
//------------------------------------------------
  
$var_7="-1";               
$var_8=".9e2";          
  
$var_9=(bool) $var_7;      
$var_10=(integer) $var_8;   
  
//------------------------------------------------
  
$var_11="яблоко";             
$var_12=1.9e-2;             
  
$var_13=(array) $var_11;     
$var_14=(array) $var_12;     
 
?>
Условие задачи №23
	*/

$var_1=true;               
$var_2=false;              
  
$var_3=(integer) $var_1;   
$var_4=(integer) $var_2;   
  
$var_5=(string) $var_1;    
$var_6=(string) $var_2;   
  
//------------------------------------------------
  
$var_7="-1";               
$var_8=".9e2";          
  
$var_9=(bool) $var_7;      
$var_10=(integer) $var_8;   
  
//------------------------------------------------
  
$var_11="яблоко";             
$var_12=1.9e-2;             
  
$var_13=(array) $var_11;     
$var_14=(array) $var_12;  
?>