<?php

	/*
  2.Выведите на экран одна за другой четыре строки: 'Всем ', 'привет ', 'от ', 'PHP!<br><br>', 
 используя для этого только один оператор echo. После данной инструкции напишите два однострочных 
 комментария: 'Для вывода слов на разных строках мы используем элемент "br", т.е разрыв строки' и 
 'Переменные выводимые оператором echo перечисляются через запятую'. Далее измените код первой части 
 так, чтобы слова после вывода на экран находились на разных строках. В самом конце нашего кода 
 напишите многострочный комментарий: 'После каждой инструкции мы будем ставить точку с запятой даже, 
 если инструкция является последней в блоке php-кода'.
	*/
	echo 'Всем ', 'привет ', 'от ', 'PHP!<br><br>';
 
//Для вывода слов на разных строках мы используем элемент "br", т.е разрыв строки
//Переменные выводимые оператором echo перечисляются через запятую
 
     echo 'Всем<br>', 'привет<br>', 'от<br>', 'PHP!';
 
//После каждой инструкции мы будем ставить точку с запятой даже, если инструкция 
//является последней в блоке php-кода!
?>