<?php

	/*
  4. Восстановите по комментариям php-код условия
	*/
//Создали переменную $a и присвоили ей число 5

 
/* Присвоение переменной по значению. После каждой операции старайтесь 
смотреть результат в браузере, используя для вывода оператор echo */
 
//Присвоили переменной $a число 15
   
//Присвоили переменной $b переменную $a, теперь $b==$a==15 
 
//Изменили значение переменной $b на 'new', при этом 
//значение переменной $a не изменилось ($a==15) 
 
//Опять присвоили переменной $b переменную $a, теперь $b==15 
 
//Изменили значение переменной $a на 'sos', при этом 
//значение переменной $b не изменилось ($b==15) 
 
/* Таким образом, переменная, присвоенная по значению, не зависит от 
переменной, которой она была присвоена */    
 

?>