<?php

	/*
20. Посмотрите на условие задачи. При попытке вывода каких элементов массива будут выведены ошибки и почему?
<?php 
 
$m_3=[4=>56, 33];    
 
$m_3[]=30;        
$m_3[8]=80;       
$m_3[]=100;       
 
echo $m_3[3]."<br>"; 
echo $m_3[4]."<br>";
echo $m_3[5]."<br>";
echo $m_3[6]."<br>";
echo $m_3[7]."<br>";
echo $m_3[8]."<br>";
echo $m_3[9]."<br>";
 
?>
	*/

$m_3=[4=>56, 33];    
 
$m_3[]=30;        
$m_3[8]=80;       
$m_3[]=100;       
 
echo $m_3[3]."<br>"; 
echo $m_3[4]."<br>";
echo $m_3[5]."<br>";
echo $m_3[6]."<br>";
echo $m_3[7]."<br>";
echo $m_3[8]."<br>";
echo $m_3[9]."<br>";
 
          
?>